; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v7 ?v1)
		(pred_4 ?v8)
		(pred_1 ?v6)
		(pred_6 ?v6)
		(pred_3 ?v8 ?v6)
		(pred_2)
		(pred_5 ?v8))

   (:action op_2
       :parameters  (?v3 ?v2)
       :precondition (and (not-eq ?v3 ?v2) 
                          (pred_1 ?v3) (pred_1 ?v2) (pred_6 ?v3))
       :effect (and  (pred_6 ?v2)
		     (not (pred_6 ?v3))))


   (:action op_1
       :parameters (?v4 ?v5)
       :precondition  (and  (pred_4 ?v4) (pred_1 ?v5)
			    (pred_3 ?v4 ?v5) (pred_6 ?v5) (pred_2))
       :effect (and (pred_5 ?v4)
		    (not (pred_3 ?v4 ?v5)) 
		    (not (pred_2))))

   (:action op_3
       :parameters  (?v4  ?v5)
       :precondition  (and  (pred_4 ?v4) (pred_1 ?v5)
			    (pred_5 ?v4) (pred_6 ?v5))
       :effect (and (pred_3 ?v4 ?v5)
		    (pred_2)
		    (not (pred_5 ?v4)))))

; problem
(define (problem ferry-l6-c3)
(:domain ferry)
(:objects obj_09 obj_06 obj_02 obj_08 obj_03 obj_04 
          obj_07 obj_01 obj_05 
)
(:init
(pred_1 obj_09)
(pred_1 obj_06)
(pred_1 obj_02)
(pred_1 obj_08)
(pred_1 obj_03)
(pred_1 obj_04)
(pred_4 obj_07)
(pred_4 obj_01)
(pred_4 obj_05)
(not-eq obj_09 obj_06)
(not-eq obj_06 obj_09)
(not-eq obj_09 obj_02)
(not-eq obj_02 obj_09)
(not-eq obj_09 obj_08)
(not-eq obj_08 obj_09)
(not-eq obj_09 obj_03)
(not-eq obj_03 obj_09)
(not-eq obj_09 obj_04)
(not-eq obj_04 obj_09)
(not-eq obj_06 obj_02)
(not-eq obj_02 obj_06)
(not-eq obj_06 obj_08)
(not-eq obj_08 obj_06)
(not-eq obj_06 obj_03)
(not-eq obj_03 obj_06)
(not-eq obj_06 obj_04)
(not-eq obj_04 obj_06)
(not-eq obj_02 obj_08)
(not-eq obj_08 obj_02)
(not-eq obj_02 obj_03)
(not-eq obj_03 obj_02)
(not-eq obj_02 obj_04)
(not-eq obj_04 obj_02)
(not-eq obj_08 obj_03)
(not-eq obj_03 obj_08)
(not-eq obj_08 obj_04)
(not-eq obj_04 obj_08)
(not-eq obj_03 obj_04)
(not-eq obj_04 obj_03)
(pred_2)
(pred_3 obj_07 obj_02)
(pred_3 obj_01 obj_09)
(pred_3 obj_05 obj_03)
(pred_6 obj_03)
)
(:goal
(and
(pred_3 obj_07 obj_06)
(pred_3 obj_01 obj_03)
(pred_3 obj_05 obj_08)
)
)

(:constraints
  (and
    (sometime-before  (pred_3 obj_07 obj_06) (pred_6 obj_09))
    (sometime-before  (pred_3 obj_01 obj_03) (pred_6 obj_06))
    (sometime-before  (pred_3 obj_05 obj_08) (pred_6 obj_09))
  )
)
)

; plan
1. (op_1 obj_05 obj_03)
   deleted: (pred_3 obj_05 obj_03) (pred_2)
   added: (pred_5 obj_05)
   goals met: 0 of 3
2. (op_2 obj_03 obj_08)
   deleted: (pred_6 obj_03)
   added: (pred_6 obj_08)
   goals met: 0 of 3
3. (op_2 obj_08 obj_06)
   deleted: (pred_6 obj_08)
   added: (pred_6 obj_06)
   goals met: 0 of 3
4. (op_3 obj_05 obj_06)
   deleted: (pred_5 obj_05)
   added: (pred_3 obj_05 obj_06) (pred_2)
   goals met: 0 of 3
5. (op_2 obj_06 obj_02)
   deleted: (pred_6 obj_06)
   added: (pred_6 obj_02)
   goals met: 0 of 3
6. (op_1 obj_07 obj_02)
   deleted: (pred_3 obj_07 obj_02) (pred_2)
   added: (pred_5 obj_07)
   goals met: 0 of 3
7. (op_2 obj_02 obj_06)
   deleted: (pred_6 obj_02)
   added: (pred_6 obj_06)
   goals met: 0 of 3
8. (op_2 obj_06 obj_03)
   deleted: (pred_6 obj_06)
   added: (pred_6 obj_03)
   goals met: 0 of 3
9. (op_3 obj_07 obj_03)
   deleted: (pred_5 obj_07)
   added: (pred_3 obj_07 obj_03) (pred_2)
   goals met: 0 of 3
10. (op_2 obj_03 obj_09)
   deleted: (pred_6 obj_03)
   added: (pred_6 obj_09)
   goals met: 0 of 3
11. (op_1 obj_01 obj_09)
   deleted: (pred_3 obj_01 obj_09) (pred_2)
   added: (pred_5 obj_01)
   goals met: 0 of 3
12. (op_2 obj_09 obj_03)
   deleted: (pred_6 obj_09)
   added: (pred_6 obj_03)
   goals met: 0 of 3
13. (op_3 obj_01 obj_03)
   deleted: (pred_5 obj_01)
   added: (pred_3 obj_01 obj_03) (pred_2)
   goals met: 1 of 3
14. (op_1 obj_07 obj_03)
   deleted: (pred_3 obj_07 obj_03) (pred_2)
   added: (pred_5 obj_07)
   goals met: 1 of 3
15. (op_2 obj_03 obj_08)
   deleted: (pred_6 obj_03)
   added: (pred_6 obj_08)
   goals met: 1 of 3
16. (op_2 obj_08 obj_06)
   deleted: (pred_6 obj_08)
   added: (pred_6 obj_06)
   goals met: 1 of 3
17. (op_3 obj_07 obj_06)
   deleted: (pred_5 obj_07)
   added: (pred_3 obj_07 obj_06) (pred_2)
   goals met: 2 of 3
18. (op_1 obj_05 obj_06)
   deleted: (pred_3 obj_05 obj_06) (pred_2)
   added: (pred_5 obj_05)
   goals met: 2 of 3
19. (op_2 obj_06 obj_08)
   deleted: (pred_6 obj_06)
   added: (pred_6 obj_08)
   goals met: 2 of 3
20. (op_3 obj_05 obj_08)
   deleted: (pred_5 obj_05)
   added: (pred_3 obj_05 obj_08) (pred_2)
   goals met: 3 of 3
